app/controllers/administrations_controller.rb

  def login
    @administration = Administration.where('login' => params[:login][:login], 'password' => params[:login][:password])
    if @administration.empty?
---
SELECT `administrations`.`id` FROM `administrations` WHERE `administrations`.`login` = 'admin' AND `administrations`.`password` = 'admin'
SELECT COUNT(*) FROM `administrations` WHERE `administrations`.`login` = 'aez' AND `administrations`.`password` = 'ez'

  def createEvent
    @event = Event.new(params.require(:newEvent).permit(:name, :descrip, :numberPiments, :promotions, :dateStart, :dateEnd))
    flash[:add_event] = "L'évenement est en ligne !"
    redirect_to "/admin/event/all"
    @event.save
---
INSERT INTO `events` (`name`, `descrip`, `numberPiments`, `promotions`, `dateStart`, `dateEnd`, `created_at`, `updated_at`) VALUES ('eaz', 'eaz', 1, 'eza', '2017-02-27', '2017-02-28', '2017-02-27 10:10:08', '2017-02-27 10:10:08')

  def listEvent
    @events = Event.paginate(:page => params[:page], :per_page => 5)
---
SELECT  `events`.* FROM `events` LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `events`

  def eventDel
    @event = Event.find(params[:id])
    flash[:del_event] = "L'évenement a était supprimé !"
    redirect_to "/admin/event/all"
    @event.destroy
---
SELECT  `events`.* FROM `events` WHERE `events`.`id` = 2 LIMIT 1
DELETE FROM `events` WHERE `events`.`id` = 2

  def update
    @events = Event.find_by_id(params[:id])
---
SELECT  `events`.* FROM `events` WHERE `events`.`id` IS NULL LIMIT 1

  def newAdmin
    @admin = Administration.new(params.require(:newAdmin).permit(:login, :password, :email, :role , :fname, :lname))
    flash[:add_admin] = "Le compte admin est crée !"
    redirect_to "/admin/default"
    @admin.save
---
INSERT INTO `administrations` (`login`, `password`, `email`, `role`, `fname`, `lname`, `created_at`, `updated_at`) VALUES ('zea', 'ae', 'z@a.com', 'admin', 'aze', 'a', '2017-03-05 20:49:49', '2017-03-05 20:49:49')

  def userList
    @user = User.paginate(:page => params[:page], :per_page => 10)
---
SELECT  `users`.* FROM `users` LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `users`

  def createPromotion
  @promo = Promo.new(params.require(:newPromo).permit(:name, :school, :date, :administrateur))
  flash[:add_event] = "Promotion crée !"
  redirect_to "/admin/promotion/all"
  @promo.save
---
INSERT INTO `promos` (`name`, `school`, `date`, `administrateur`, `created_at`, `updated_at`) VALUES ('zea', 'eza', '2017-02-28', 1, '2017-02-27 14:55:31', '2017-02-27 14:55:31')

  def listPromotion
    @listPromotion = Promo.paginate(:page => params[:page], :per_page => 5)
---
SELECT  `promos`.* FROM `promos` LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `promos`

  def updateUser
    @user = User.find_by_id(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def userUpdate
   @id = params[:updateUser][:id]
    @userUpdate = User.where(:id => @id).update_all(params.require(:updateUser).permit(:id, :email, :role, :nbrPiments, :promotion))
---
UPDATE `users` SET `email` = 'arnaud.carpentras@epitech.eu', `role` = 'zstudent', `nbrPiments` = '', `promotion` = 1, `updated_at` = '2017-03-05 21:43:47' WHERE `users`.`id` = 27