app/controllers/users_controller.rb

SELECT `users`.`id` FROM `users` WHERE `users`.`email` = 'vincent.jorge@epitech.eu'
---
  def login
    @login = params[:login][:login]
    @password = params[:login][:password]
    require 'uri'
    require 'net/http'
    url = URI("https://intra.epitech.eu")
    http = Net::HTTP.new(url.host, url.port)
    http.use_ssl = true
    http.verify_mode = OpenSSL::SSL::VERIFY_NONE
    request = Net::HTTP::Post.new(url)
    request["cache-control"] = 'no-cache'
    request["content-type"] = 'application/x-www-form-urlencoded'
    request.body = "login=#{@login}&password=#{@password}&format=json"
    response = http.request(request)
    puts response.read_body
    if response.read_body == "Moved to <a href=\"/\">\"/\"</a>"
      @user = User.where('email' => params[:login][:login])

SELECT `events`.* FROM `events` WHERE `events`.`promotions` = '1'
---
  def home
  @event = Event.where(:promotions =>  @user[0][:promotion])

SELECT `events`.* FROM `events` WHERE `events`.`promotions` = '1'
---
  def joinEvent
  @event = Event.where(:promotions =>  @user[0][:promotion])

INSERT INTO `user_events` (`idUser`, `idEvent`, `created_at`, `updated_at`) VALUES (1, 1, '2017-03-05 20:24:27', '2017-03-05 20:24:27')
---
  def eventJoin
    @event = UserEvent.new(:idUser => @user[0][:promotion], :idEvent => 1)
    @event.save