app/views/administrations/newEvent.html.erb

SELECT `promos`.* FROM `promos`
---
      <%= f.label "Promotions" %><br>
      <%= f.collection_select :promotions, Promo.all, :id, :id, prompt: true, class: "form-control" %>    </p>